// Import Swiper React components
import { Swiper, SwiperSlide } from 'swiper/react';
import { Autoplay } from 'swiper/modules';

// Import Swiper styles
import 'swiper/css';

const announcements = [
  'يرجى الانتباه أن النتائج الموجودة هي نتائج قديمة للعام الدراسي السابق -2025-.',
  'يرجى العلم أن عنوان المنصة هذا سيتم الاستغناء عنه قريبًا -إن شاء الله-، وسيتم نقل جميع الخدمات إلى عنوان جديد.',
  'لمتابعة تحديثات المنصة؛ بإمكانكم الانضمام إلى قناة التليجرام.',
  'يرجى الانتباه أن النتائج الموجودة هي نتائج قديمة للعام الدراسي السابق -2025-.',
  'يرجى العلم أن عنوان المنصة هذا سيتم الاستغناء عنه قريبًا -إن شاء الله-، وسيتم نقل جميع الخدمات إلى عنوان جديد.',
  'لمتابعة تحديثات المنصة؛ بإمكانكم الانضمام إلى قناة التليجرام.',
  'يرجى الانتباه أن النتائج الموجودة هي نتائج قديمة للعام الدراسي السابق -2025-.',
  'يرجى العلم أن عنوان المنصة هذا سيتم الاستغناء عنه قريبًا -إن شاء الله-، وسيتم نقل جميع الخدمات إلى عنوان جديد.',
  'لمتابعة تحديثات المنصة؛ بإمكانكم الانضمام إلى قناة التليجرام.',
  'يرجى الانتباه أن النتائج الموجودة هي نتائج قديمة للعام الدراسي السابق -2025-.',
  'يرجى العلم أن عنوان المنصة هذا سيتم الاستغناء عنه قريبًا -إن شاء الله-، وسيتم نقل جميع الخدمات إلى عنوان جديد.',
  'لمتابعة تحديثات المنصة؛ بإمكانكم الانضمام إلى قناة التليجرام.',
  'يرجى الانتباه أن النتائج الموجودة هي نتائج قديمة للعام الدراسي السابق -2025-.',
  'يرجى العلم أن عنوان المنصة هذا سيتم الاستغناء عنه قريبًا -إن شاء الله-، وسيتم نقل جميع الخدمات إلى عنوان جديد.',
  'لمتابعة تحديثات المنصة؛ بإمكانكم الانضمام إلى قناة التليجرام.',
  'يرجى الانتباه أن النتائج الموجودة هي نتائج قديمة للعام الدراسي السابق -2025-.',
  'يرجى العلم أن عنوان المنصة هذا سيتم الاستغناء عنه قريبًا -إن شاء الله-، وسيتم نقل جميع الخدمات إلى عنوان جديد.',
  'لمتابعة تحديثات المنصة؛ بإمكانكم الانضمام إلى قناة التليجرام.',
];

const AnnouncementsBar = () => {
  return (
    <div className="bg-dark py-3 border-top">
      <Swiper
        slidesPerView="auto"
        spaceBetween={50}
        loop
        speed={5000}
        allowTouchMove={false}
        autoplay={{
          delay: 0,
          disableOnInteraction: false,
        }}
        modules={[Autoplay]}
        style={{
          transitionTimingFunction: 'linear',
        }}
      >
        {announcements.map((announcement, index) => (
          <>
            <SwiperSlide
              key={index}
              className="w-auto d-flex align-items-center gap-5 whitespace-nowrap"
            >
              <p className="m-0 text-white">{announcement}</p>
              ||||||
            </SwiperSlide>
          </>
        ))}
      </Swiper>
    </div>
  );
};

export default AnnouncementsBar;
